src/SimplyTestable/ApiBundle/Tests/Fixtures/Data/Stripe/customer-hascard-nosub.json

{
  "id": "{stripe-customer-id}",
  "object": "customer",
  "account_balance": 0,
  "created": 1426768419,
  "currency": "gbp",
  "default_source": "card_Bb49mNCO7Q6no2",
  "delinquent": true,
  "description": "Has card no sub",
  "discount": null,
  "email": "{stripe-customer-email}",
  "livemode": false,
  "metadata": {},
  "shipping": null,
  "sources": {
    "object": "list",
    "data": [
      {
        "id": "card_Bb49mNCO7Q6no2",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": "{stripe-customer-id}",
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 12,
        "exp_year": 2022,
        "fingerprint": "7y5WDQllCuyzj32D",
        "funding": "credit",
        "last4": "4242",
        "metadata": {},
        "name": null,
        "tokenization_method": null,
        "type": "Visa"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/{stripe-customer-id}/sources",
    "count": 1
  },
  "subscriptions": {
    "object": "list",
    "data": [],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/customers/{stripe-customer-id}/subscriptions",
    "count": 0
  },
  "cards": {
    "object": "list",
    "data": [
      {
        "id": "card_Bb49mNCO7Q6no2",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": "{stripe-customer-id}",
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 12,
        "exp_year": 2022,
        "fingerprint": "7y5WDQllCuyzj32D",
        "funding": "credit",
        "last4": "4242",
        "metadata": {},
        "name": null,
        "tokenization_method": null,
        "type": "Visa"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/{stripe-customer-id}/cards",
    "count": 1
  },
  "default_card": "card_Bb49mNCO7Q6no2",
  "subscription": null,
  "active_card": {
    "id": "card_Bb49mNCO7Q6no2",
    "object": "card",
    "address_city": null,
    "address_country": null,
    "address_line1": null,
    "address_line1_check": null,
    "address_line2": null,
    "address_state": null,
    "address_zip": null,
    "address_zip_check": null,
    "brand": "Visa",
    "country": "US",
    "customer": "{stripe-customer-id}",
    "cvc_check": "pass",
    "dynamic_last4": null,
    "exp_month": 12,
    "exp_year": 2022,
    "fingerprint": "7y5WDQllCuyzj32D",
    "funding": "credit",
    "last4": "4242",
    "metadata": {},
    "name": null,
    "tokenization_method": null,
    "type": "Visa"
  }
}